hw203/nRF51_SDK_10.0.0_Example/ble_app_hrs_c_with_W5500/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}

/** @brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();

    APP_ERROR_CHECK(err_code);
}

static void publish_data_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    uint8_t sn = 0;
    uint32_t ret;
    uint8_t eth_data[512];
    hrs_c_evt_data hr_data;
    bas_c_evt_data batt_data;

    // Connect to server
    if(app_mailbox_length_get(&hr_data_mailbox) || app_mailbox_length_get(&bas_data_mailbox))
    {
    	if(getSn_SR(sn) != SOCK_CLOSED)
    	{
    		close(sn);
    		disconnect(sn);
    	}
    	while(getSn_SR(sn) != SOCK_CLOSED);

    	if( ret = socket(sn, Sn_MR_TCP, any_port++, 0x00) != sn )
    	{
			APPL_LOG("[PUBLISH]: Socket open failed, reason %d\r\n", ret);
			return;
    	}

    	if( ret = connect(sn, dweet_io_ip, dest_port) != SOCK_OK )
		{
			APPL_LOG("[PUBLISH]: Socket Connection failed, reason %d\r\n", ret);
			return;
		}
    }
    else	return;

    // Publish collected data
    while( app_mailbox_length_get(&hr_data_mailbox) != 0)
    {
    	app_mailbox_get(&hr_data_mailbox,&hr_data);
    	sprintf(eth_data,"GET /dweet/for/%s?%s=%d HTTP/1.1\r\nHost: dweet. io\r\n\r\n",THING,HEART_RATE,hr_data.evt_data);
    	send(sn,eth_data,strlen((uint8_t*)eth_data));
    }

    while( app_mailbox_length_get(&bas_data_mailbox) != 0)
    {
    	app_mailbox_get(&bas_data_mailbox,&batt_data);
    	sprintf(eth_data,"GET /dweet/for/%s?%s=%d HTTP/1.1\r\nHost: dweet. io\r\n\r\n",THING,BATTERY,batt_data.battery_level);
    	send(sn,eth_data,strlen((uint8_t*)eth_data));
    }

    close(sn);
    disconnect(sn);
}

APP_TIMER_DEF(m_publish_data_timer_id);												/**< Publish data timer. */
#define PUBLISH_INTERVAL             	APP_TIMER_TICKS(300, APP_TIMER_PRESCALER)	/**< RR interval interval (ticks). */


int main(void)
{
    bool erase_bonds;
    uint32_t err_code;

    // Initialize.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, NULL);

    buttons_leds_init(&erase_bonds);
    uart_init();
    printf("Heart rate collector example\r\n");

    spi0_master_init();
    user_ethernet_init();

    app_mailbox_create(&hr_data_mailbox);
    app_mailbox_create(&bas_data_mailbox);

    ble_stack_init();
    device_manager_init(erase_bonds);
    db_discovery_init();

    hrs_c_init();
    bas_c_init();


    // Start scanning for peripherals and initiate connection
    // with devices that advertise Heart Rate UUID.
    scan_start();

    err_code = app_timer_create(&m_publish_data_timer_id, APP_TIMER_MODE_REPEATED, publish_data_handler);
    APP_ERROR_CHECK(err_code);
    err_code = app_timer_start(m_publish_data_timer_id,PUBLISH_INTERVAL,NULL);
    APP_ERROR_CHECK(err_code);


    for (;; )
    {
    	power_manage();
    }
}
